; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v10 ?v8)
             (pred_2 ?v9 ?v4)
             (pred_1 ?v10 ?v4)
             (pred_9 ?v6 ?v10 )
	     (pred_5 ?v10)
             (pred_8 ?v13)
             (pred_6 ?v9)
             (pred_7 ?v4)
             (pred_3 ?v10)
             (pred_12 ?v9)
             (pred_11 ?v10)
             (pred_10 ))



(:action op_1
:parameters (?v2 ?v3 ?v11 ?v1)
:precondition (and (pred_8 ?v2) (pred_8 ?v3) (pred_6 ?v11) (pred_7 ?v1)
          (pred_4 ?v2 ?v3) (pred_2 ?v11 ?v1)
                   (pred_1 ?v3 ?v1) (pred_5 ?v2) 
                   (pred_3 ?v3) (pred_12 ?v11))
:effect (and  (pred_11 ?v3) (not (pred_3 ?v3))))


(:action op_4
:parameters (?v2 ?v7)
:precondition (and (pred_8 ?v2) (pred_8 ?v7)
               (pred_5 ?v2) (pred_4 ?v2 ?v7) (pred_11 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v2))))

(:action op_5
:parameters (?v2 ?v11)
:precondition (and (pred_8 ?v2) (pred_6 ?v11) 
                  (pred_5 ?v2) (pred_9 ?v11 ?v2) (pred_10 ))
:effect (and (pred_12 ?v11)
   (not (pred_9 ?v11 ?v2)) (not (pred_10 ))))


(:action op_3
:parameters (?v2 ?v5 ?v12)
:precondition (and (pred_8 ?v2) (pred_6 ?v5) (pred_6 ?v12)
                  (pred_5 ?v2) (pred_12 ?v12) (pred_9 ?v5 ?v2))
:effect (and (pred_12 ?v5) (pred_9 ?v12 ?v2)
        (not (pred_12 ?v12)) (not (pred_9 ?v5 ?v2))))

(:action op_2
:parameters (?v2 ?v11)
:precondition (and (pred_8 ?v2) (pred_6 ?v11) 
                  (pred_5 ?v2) (pred_12 ?v11))
:effect (and (pred_10 ) (pred_9 ?v11 ?v2) (not (pred_12 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_21 obj_08 obj_29 obj_01 obj_18 obj_16 obj_28 obj_02 obj_15 obj_26 obj_19 obj_05 obj_31 obj_07 obj_13 obj_27 obj_14 obj_20 obj_30 obj_11 obj_23 obj_24 obj_25 obj_03 obj_10
    obj_22 obj_06 obj_12
    obj_09 obj_17 obj_32 obj_04
    )

    (:init
       (pred_10)

       (pred_8 obj_21)
       (pred_8 obj_08)
       (pred_8 obj_29)
       (pred_8 obj_01)
       (pred_8 obj_18)
       (pred_8 obj_16)
       (pred_8 obj_28)
       (pred_8 obj_02)
       (pred_8 obj_15)
       (pred_8 obj_26)
       (pred_8 obj_19)
       (pred_8 obj_05)
       (pred_8 obj_31)
       (pred_8 obj_07)
       (pred_8 obj_13)
       (pred_8 obj_27)
       (pred_8 obj_14)
       (pred_8 obj_20)
       (pred_8 obj_30)
       (pred_8 obj_11)
       (pred_8 obj_23)
       (pred_8 obj_24)
       (pred_8 obj_25)
       (pred_8 obj_03)
       (pred_8 obj_10)
       (pred_7 obj_22)
       (pred_7 obj_06)
       (pred_7 obj_12)
       (pred_6 obj_09)
       (pred_6 obj_17)
       (pred_6 obj_32)
       (pred_6 obj_04)

       (pred_4 obj_21 obj_16)
       (pred_4 obj_21 obj_08)
       (pred_4 obj_08 obj_28)
       (pred_4 obj_08 obj_29)
       (pred_4 obj_08 obj_21)
       (pred_4 obj_29 obj_02)
       (pred_4 obj_29 obj_01)
       (pred_4 obj_29 obj_08)
       (pred_4 obj_01 obj_15)
       (pred_4 obj_01 obj_18)
       (pred_4 obj_01 obj_29)
       (pred_4 obj_18 obj_26)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_28)
       (pred_4 obj_16 obj_21)
       (pred_4 obj_28 obj_05)
       (pred_4 obj_28 obj_02)
       (pred_4 obj_28 obj_08)
       (pred_4 obj_28 obj_16)
       (pred_4 obj_02 obj_31)
       (pred_4 obj_02 obj_15)
       (pred_4 obj_02 obj_29)
       (pred_4 obj_02 obj_28)
       (pred_4 obj_15 obj_07)
       (pred_4 obj_15 obj_26)
       (pred_4 obj_15 obj_01)
       (pred_4 obj_15 obj_02)
       (pred_4 obj_26 obj_13)
       (pred_4 obj_26 obj_18)
       (pred_4 obj_26 obj_15)
       (pred_4 obj_19 obj_27)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_05 obj_14)
       (pred_4 obj_05 obj_31)
       (pred_4 obj_05 obj_28)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_31 obj_20)
       (pred_4 obj_31 obj_07)
       (pred_4 obj_31 obj_02)
       (pred_4 obj_31 obj_05)
       (pred_4 obj_07 obj_30)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_15)
       (pred_4 obj_07 obj_31)
       (pred_4 obj_13 obj_11)
       (pred_4 obj_13 obj_26)
       (pred_4 obj_13 obj_07)
       (pred_4 obj_27 obj_23)
       (pred_4 obj_27 obj_14)
       (pred_4 obj_27 obj_19)
       (pred_4 obj_14 obj_24)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_14 obj_05)
       (pred_4 obj_14 obj_27)
       (pred_4 obj_20 obj_25)
       (pred_4 obj_20 obj_30)
       (pred_4 obj_20 obj_31)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_30 obj_03)
       (pred_4 obj_30 obj_11)
       (pred_4 obj_30 obj_07)
       (pred_4 obj_30 obj_20)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_11 obj_13)
       (pred_4 obj_11 obj_30)
       (pred_4 obj_23 obj_24)
       (pred_4 obj_23 obj_27)
       (pred_4 obj_24 obj_25)
       (pred_4 obj_24 obj_14)
       (pred_4 obj_24 obj_23)
       (pred_4 obj_25 obj_03)
       (pred_4 obj_25 obj_20)
       (pred_4 obj_25 obj_24)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_03 obj_30)
       (pred_4 obj_03 obj_25)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_10 obj_03)
       (pred_3 obj_24)
       (pred_3 obj_14)
       (pred_3 obj_16)
       (pred_3 obj_15)
       (pred_1  obj_24 obj_22)
       (pred_1  obj_14 obj_06)
       (pred_1  obj_16 obj_12)
       (pred_1  obj_15 obj_06)
       (pred_11 obj_21)
       (pred_11 obj_08)
       (pred_11 obj_29)
       (pred_11 obj_01)
       (pred_11 obj_18)
       (pred_11 obj_28)
       (pred_11 obj_02)
       (pred_11 obj_26)
       (pred_11 obj_19)
       (pred_11 obj_05)
       (pred_11 obj_31)
       (pred_11 obj_07)
       (pred_11 obj_13)
       (pred_11 obj_27)
       (pred_11 obj_20)
       (pred_11 obj_30)
       (pred_11 obj_11)
       (pred_11 obj_23)
       (pred_11 obj_25)
       (pred_11 obj_03)
       (pred_11 obj_10)

       (pred_2  obj_09 obj_22)
       (pred_2  obj_17 obj_06)
       (pred_2  obj_32 obj_12)
       (pred_2  obj_04 obj_12)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_17 obj_31)
       (pred_9 obj_32 obj_29)
       (pred_9 obj_04 obj_27)
       (pred_5 obj_03)
    )

    (:goal (and
       (pred_9 obj_09 obj_07)
       (pred_9 obj_32 obj_05)
    ))
(:constraints
  (always (not (pred_5 obj_30)))
)
)

; plan
1. (op_4 obj_03 obj_25)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_25)
   goals met: 0 of 2
2. (op_4 obj_25 obj_20)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_20)
   goals met: 0 of 2
3. (op_4 obj_20 obj_31)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_31)
   goals met: 0 of 2
4. (op_4 obj_31 obj_05)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_05)
   goals met: 0 of 2
5. (op_4 obj_05 obj_19)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_19)
   goals met: 0 of 2
6. (op_5 obj_19 obj_09)
   deleted: (pred_9 obj_09 obj_19) (pred_10)
   added: (pred_12 obj_09)
   goals met: 0 of 2
7. (op_4 obj_19 obj_05)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_05)
   goals met: 0 of 2
8. (op_4 obj_05 obj_31)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_31)
   goals met: 0 of 2
9. (op_4 obj_31 obj_07)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_07)
   goals met: 0 of 2
10. (op_2 obj_07 obj_09)
   deleted: (pred_12 obj_09)
   added: (pred_10) (pred_9 obj_09 obj_07)
   goals met: 1 of 2
11. (op_4 obj_07 obj_31)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_31)
   goals met: 1 of 2
12. (op_4 obj_31 obj_02)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_02)
   goals met: 1 of 2
13. (op_4 obj_02 obj_29)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_29)
   goals met: 1 of 2
14. (op_5 obj_29 obj_32)
   deleted: (pred_9 obj_32 obj_29) (pred_10)
   added: (pred_12 obj_32)
   goals met: 1 of 2
15. (op_4 obj_29 obj_08)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_08)
   goals met: 1 of 2
16. (op_4 obj_08 obj_28)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_28)
   goals met: 1 of 2
17. (op_4 obj_28 obj_05)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_05)
   goals met: 1 of 2
18. (op_2 obj_05 obj_32)
   deleted: (pred_12 obj_32)
   added: (pred_10) (pred_9 obj_32 obj_05)
   goals met: 2 of 2
